In [68]:
import numpy as np
import pandas as pd

In [69]:
import warnings
warnings.filterwarnings('ignore')

In [70]:
import re
import string

In [71]:
data = pd.read_csv("data.csv",encoding = 'ISO-8859-1')

In [72]:
data

,0,1467810369,Mon Apr 06 22:19:45 PDT 2009,NO_QUERY,_TheSpecialOne_,"@switchfoot http://twitpic.com/2y1zl - Awww, that's a bummer. You shoulda got David Carr of Third Day to do it. ;D"
0,0,1467810672,Mon Apr 06 22:19:49 PDT 2009,NO_QUERY,scotthamilton,is upset that he can't update his Facebook by ...
1,0,1467810917,Mon Apr 06 22:19:53 PDT 2009,NO_QUERY,mattycus,@Kenichan I dived many times for the ball. Man...
2,0,1467811184,Mon Apr 06 22:19:57 PDT 2009,NO_QUERY,ElleCTF,my whole body feels itchy and like its on fire
3,0,1467811193,Mon Apr 06 22:19:57 PDT 2009,NO_QUERY,Karoli,"@nationwideclass no, it's not behaving at all...."
4,0,1467811372,Mon Apr 06 22:20:00 PDT 2009,NO_QUERY,joy_wolf,@Kwesidei not the whole crew
...,...,...,...,...,...,...
1599994,4,2193601966,Tue Jun 16 08:40:49 PDT 2009,NO_QUERY,AmandaMarie1028,Just woke up. Having no school is the best fee...
1599995,4,2193601969,Tue Jun 16 08:40:49 PDT 2009,NO_QUERY,TheWDBoards,TheWDB.com - Very cool to hear old Walt interv...
1599996,4,2193601991,Tue Jun 16 08:40:49 PDT 2009,NO_QUERY,bpbabe,Are you ready for your MoJo Makeover? Ask me f...
1599997,4,2193602064,Tue Jun 16 08:40:49 PDT 2009,NO_QUERY,tinydiamondz,Happy 38th Birthday to my boo of alll time!!! ...
1599998,4,2193602129,Tue Jun 16 08:40:50 PDT 2009,NO_QUERY,RyanTrevMorris,happy #charitytuesday @theNSPCC @SparksCharity...

In [73]:
data.columns = ['label','time','date','query','username','text']

In [74]:
data.head()

,label,time,date,query,username,text
0,0,1467810672,Mon Apr 06 22:19:49 PDT 2009,NO_QUERY,scotthamilton,is upset that he can't update his Facebook by ...
1,0,1467810917,Mon Apr 06 22:19:53 PDT 2009,NO_QUERY,mattycus,@Kenichan I dived many times for the ball. Man...
2,0,1467811184,Mon Apr 06 22:19:57 PDT 2009,NO_QUERY,ElleCTF,my whole body feels itchy and like its on fire
3,0,1467811193,Mon Apr 06 22:19:57 PDT 2009,NO_QUERY,Karoli,"@nationwideclass no, it's not behaving at all...."
4,0,1467811372,Mon Apr 06 22:20:00 PDT 2009,NO_QUERY,joy_wolf,@Kwesidei not the whole crew

In [75]:
data.tail()

,label,time,date,query,username,text
1599994,4,2193601966,Tue Jun 16 08:40:49 PDT 2009,NO_QUERY,AmandaMarie1028,Just woke up. Having no school is the best fee...
1599995,4,2193601969,Tue Jun 16 08:40:49 PDT 2009,NO_QUERY,TheWDBoards,TheWDB.com - Very cool to hear old Walt interv...
1599996,4,2193601991,Tue Jun 16 08:40:49 PDT 2009,NO_QUERY,bpbabe,Are you ready for your MoJo Makeover? Ask me f...
1599997,4,2193602064,Tue Jun 16 08:40:49 PDT 2009,NO_QUERY,tinydiamondz,Happy 38th Birthday to my boo of alll time!!! ...
1599998,4,2193602129,Tue Jun 16 08:40:50 PDT 2009,NO_QUERY,RyanTrevMorris,happy #charitytuesday @theNSPCC @SparksCharity...

In [76]:
data.shape

(1599999, 6)

In [77]:
data.columns

Index(['label', 'time', 'date', 'query', 'username', 'text'], dtype='object')

In [78]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1599999 entries, 0 to 1599998
Data columns (total 6 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   label     1599999 non-null  int64
 1   time      1599999 non-null  int64
 2   date      1599999 non-null  object
 3   query     1599999 non-null  object
 4   username  1599999 non-null  object
 5   text      1599999 non-null  object
dtypes: int64(2), object(4)
memory usage: 73.2+ MB

In [79]:
data.describe()

              label          time
count  1.599999e+06  1.599999e+06
mean   2.000001e+00  1.998818e+09
std    2.000001e+00  1.935757e+08
min    0.000000e+00  1.467811e+09
25%    0.000000e+00  1.956916e+09
50%    4.000000e+00  2.002102e+09
75%    4.000000e+00  2.177059e+09
max    4.000000e+00  2.329206e+09

In [80]:
np.sum(data.isnull().any(axis=1))

0

In [81]:
data.head()

,label,time,date,query,username,text
0,0,1467810672,Mon Apr 06 22:19:49 PDT 2009,NO_QUERY,scotthamilton,is upset that he can't update his Facebook by ...
1,0,1467810917,Mon Apr 06 22:19:53 PDT 2009,NO_QUERY,mattycus,@Kenichan I dived many times for the ball. Man...
2,0,1467811184,Mon Apr 06 22:19:57 PDT 2009,NO_QUERY,ElleCTF,my whole body feels itchy and like its on fire
3,0,1467811193,Mon Apr 06 22:19:57 PDT 2009,NO_QUERY,Karoli,"@nationwideclass no, it's not behaving at all...."
4,0,1467811372,Mon Apr 06 22:20:00 PDT 2009,NO_QUERY,joy_wolf,@Kwesidei not the whole crew

In [82]:
data = data[['label','text']]

In [83]:
data.head()

   label                                               text
0      0  is upset that he can't update his Facebook by ...
1      0  @Kenichan I dived many times for the ball. Man...
2      0    my whole body feels itchy and like its on fire
3      0  @nationwideclass no, it's not behaving at all....
4      0                      @Kwesidei not the whole crew

In [84]:
data

         label                                               text
0            0  is upset that he can't update his Facebook by ...
1            0  @Kenichan I dived many times for the ball. Man...
2            0    my whole body feels itchy and like its on fire
3            0  @nationwideclass no, it's not behaving at all....
4            0                      @Kwesidei not the whole crew
...        ...                                                ...
1599994      4  Just woke up. Having no school is the best fee...
1599995      4  TheWDB.com - Very cool to hear old Walt interv...
1599996      4  Are you ready for your MoJo Makeover? Ask me f...
1599997      4  Happy 38th Birthday to my boo of alll time!!! ...
1599998      4  happy #charitytuesday @theNSPCC @SparksCharity...

[1599999 rows x 2 columns]

In [85]:
#replacing 4 with 1 in data label, 1 shows +ve review and 0 for -ve review

data['label'][data['label']==4]=1

In [86]:
data

         label                                               text
0            0  is upset that he can't update his Facebook by ...
1            0  @Kenichan I dived many times for the ball. Man...
2            0    my whole body feels itchy and like its on fire
3            0  @nationwideclass no, it's not behaving at all....
4            0                      @Kwesidei not the whole crew
...        ...                                                ...
1599994      1  Just woke up. Having no school is the best fee...
1599995      1  TheWDB.com - Very cool to hear old Walt interv...
1599996      1  Are you ready for your MoJo Makeover? Ask me f...
1599997      1  Happy 38th Birthday to my boo of alll time!!! ...
1599998      1  happy #charitytuesday @theNSPCC @SparksCharity...

[1599999 rows x 2 columns]

In [87]:
#Separation of +ve and -ve tweets
data_pos = data[data['label']==1]
data_neg = data[data['label']==0]

In [88]:
data_pos

         label                                               text
799999       1       I LOVE @Health4UandPets u guys r the best!!
800000       1  im meeting up with one of my besties tonight! ...
800001       1  @DaRealSunisaKim Thanks for the Twitter add, S...
800002       1  Being sick can be really cheap when it hurts t...
800003       1    @LovesBrooklyn2 he has that effect on everyone
...        ...                                                ...
1599994      1  Just woke up. Having no school is the best fee...
1599995      1  TheWDB.com - Very cool to hear old Walt interv...
1599996      1  Are you ready for your MoJo Makeover? Ask me f...
1599997      1  Happy 38th Birthday to my boo of alll time!!! ...
1599998      1  happy #charitytuesday @theNSPCC @SparksCharity...

[800000 rows x 2 columns]

In [89]:
data_neg

        label                                               text
0           0  is upset that he can't update his Facebook by ...
1           0  @Kenichan I dived many times for the ball. Man...
2           0    my whole body feels itchy and like its on fire
3           0  @nationwideclass no, it's not behaving at all....
4           0                      @Kwesidei not the whole crew
...       ...                                                ...
799994      0  Sick  Spending my day laying in bed listening ...
799995      0                                    Gmail is down?
799996      0                      rest in peace Farrah! So sad
799997      0  @Eric_Urbane Sounds like a rival is flagging y...
799998      0  has to resit exams over summer...  wishes he w...

[799999 rows x 2 columns]

In [90]:
data_pos.shape

(800000, 2)

In [91]:
data_neg.shape

(799999, 2)

In [92]:
#Taking only 1/4 each type of data in order to reduce computational overhead
data_pos = data_pos.iloc[:int(25000)]
data_neg = data_neg.iloc[:int(25000)]

In [93]:
#Combine these +ve and -ve reviews in order to train in model
data = pd.concat([data_pos,data_neg])

In [94]:
data.shape

(50000, 2)

In [95]:
#lOWERCASING
data['text'] = data['text'].str.lower()

In [96]:
data.head()

        label                                               text
799999      1       i love @health4uandpets u guys r the best!!
800000      1  im meeting up with one of my besties tonight! ...
800001      1  @darealsunisakim thanks for the twitter add, s...
800002      1  being sick can be really cheap when it hurts t...
800003      1    @lovesbrooklyn2 he has that effect on everyone

In [97]:
#Removing the stopwords
import nltk

In [98]:
nltk.download('stopwords')

[nltk_data] Downloading package stopwords to
[nltk_data]     C:\Users\ace\AppData\Roaming\nltk_data...
[nltk_data]   Package stopwords is already up-to-date!

True

In [99]:
from nltk.corpus import stopwords

In [100]:
stp_list = stopwords.words('english')

In [101]:
", ".join(stopwords.words('english'))

"i, me, my, myself, we, our, ours, ourselves, you, you're, you've, you'll, you'd, your, yours, yourself, yourselves, he, him, his, himself, she, she's, her, hers, herself, it, it's, its, itself, they, them, their, theirs, themselves, what, which, who, whom, this, that, that'll, these, those, am, is, are, was, were, be, been, being, have, has, had, having, do, does, did, doing, a, an, the, and, but, if, or, because, as, until, while, of, at, by, for, with, about, against, between, into, through, during, before, after, above, below, to, from, up, down, in, out, on, off, over, under, again, further, then, once, here, there, when, where, why, how, all, any, both, each, few, more, most, other, some, such, no, nor, not, only, own, same, so, than, too, very, s, t, can, will, just, don, don't, should, should've, now, d, ll, m, o, re, ve, y, ain, aren, aren't, couldn, couldn't, didn, didn't, doesn, doesn't, hadn, hadn't, hasn, hasn't, haven, haven't, isn, isn't, ma, mightn, mightn't, mustn, mustn't, needn, needn't, shan, shan't, shouldn, shouldn't, wasn, wasn't, weren, weren't, won, won't, wouldn, wouldn't"

In [102]:
#Cleaning and removing that stoplist from our data
def cleaning_stopwords(text):
    return " ".join([word for word in str(text).split() if word not in stp_list])

In [103]:
data['text'] = data['text'].apply(lambda text: cleaning_stopwords(text))

In [104]:
data.head()

        label                                               text
799999      1              love @health4uandpets u guys r best!!
800000      1  im meeting one besties tonight! cant wait!! - ...
800001      1  @darealsunisakim thanks twitter add, sunisa! g...
800002      1  sick really cheap hurts much eat real food plu...
800003      1                    @lovesbrooklyn2 effect everyone